###############################################################################
# Created by write_sdc
###############################################################################
current_design pipelined_mult
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_clock_uncertainty -setup 1.5000 clk
set_clock_uncertainty -hold 0.5000 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[0]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[0]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[10]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[10]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[11]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[11]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[12]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[12]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[13]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[13]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[14]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[14]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[15]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[15]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[16]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[16]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[17]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[17]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[18]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[18]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[19]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[19]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[1]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[1]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[20]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[20]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[21]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[21]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[22]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[22]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[23]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[23]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[24]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[24]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[25]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[25]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[26]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[26]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[27]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[27]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[28]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[28]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[29]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[29]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[2]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[2]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[30]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[30]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[31]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[31]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[3]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[3]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[4]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[4]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[5]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[5]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[6]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[6]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[7]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[7]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[8]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[8]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[9]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[9]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[0]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[0]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[10]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[10]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[11]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[11]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[12]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[12]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[13]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[13]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[14]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[14]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[15]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[15]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[16]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[16]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[17]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[17]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[18]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[18]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[19]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[19]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[1]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[1]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[20]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[20]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[21]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[21]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[22]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[22]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[23]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[23]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[24]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[24]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[25]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[25]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[26]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[26]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[27]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[27]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[28]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[28]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[29]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[29]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[2]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[2]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[30]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[30]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[31]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[31]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[3]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[3]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[4]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[4]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[5]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[5]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[6]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[6]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[7]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[7]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[8]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[8]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[9]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[9]}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {rst}]
set_input_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {rst}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[0]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[0]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[10]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[10]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[11]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[11]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[12]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[12]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[13]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[13]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[14]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[14]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[15]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[15]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[16]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[16]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[17]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[17]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[18]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[18]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[19]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[19]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[1]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[1]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[20]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[20]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[21]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[21]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[22]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[22]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[23]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[23]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[24]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[24]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[25]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[25]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[26]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[26]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[27]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[27]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[28]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[28]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[29]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[29]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[2]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[2]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[30]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[30]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[31]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[31]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[32]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[32]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[33]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[33]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[34]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[34]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[35]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[35]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[36]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[36]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[37]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[37]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[38]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[38]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[39]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[39]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[3]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[3]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[40]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[40]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[41]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[41]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[42]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[42]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[43]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[43]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[44]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[44]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[45]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[45]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[46]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[46]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[47]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[47]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[48]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[48]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[49]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[49]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[4]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[4]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[50]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[50]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[51]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[51]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[52]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[52]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[53]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[53]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[54]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[54]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[55]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[55]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[56]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[56]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[57]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[57]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[58]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[58]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[59]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[59]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[5]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[5]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[60]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[60]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[61]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[61]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[62]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[62]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[63]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[63]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[6]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[6]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[7]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[7]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[8]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[8]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {p[9]}]
set_output_delay 0.4000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {p[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0300 [get_ports {p[63]}]
set_load -pin_load 0.0300 [get_ports {p[62]}]
set_load -pin_load 0.0300 [get_ports {p[61]}]
set_load -pin_load 0.0300 [get_ports {p[60]}]
set_load -pin_load 0.0300 [get_ports {p[59]}]
set_load -pin_load 0.0300 [get_ports {p[58]}]
set_load -pin_load 0.0300 [get_ports {p[57]}]
set_load -pin_load 0.0300 [get_ports {p[56]}]
set_load -pin_load 0.0300 [get_ports {p[55]}]
set_load -pin_load 0.0300 [get_ports {p[54]}]
set_load -pin_load 0.0300 [get_ports {p[53]}]
set_load -pin_load 0.0300 [get_ports {p[52]}]
set_load -pin_load 0.0300 [get_ports {p[51]}]
set_load -pin_load 0.0300 [get_ports {p[50]}]
set_load -pin_load 0.0300 [get_ports {p[49]}]
set_load -pin_load 0.0300 [get_ports {p[48]}]
set_load -pin_load 0.0300 [get_ports {p[47]}]
set_load -pin_load 0.0300 [get_ports {p[46]}]
set_load -pin_load 0.0300 [get_ports {p[45]}]
set_load -pin_load 0.0300 [get_ports {p[44]}]
set_load -pin_load 0.0300 [get_ports {p[43]}]
set_load -pin_load 0.0300 [get_ports {p[42]}]
set_load -pin_load 0.0300 [get_ports {p[41]}]
set_load -pin_load 0.0300 [get_ports {p[40]}]
set_load -pin_load 0.0300 [get_ports {p[39]}]
set_load -pin_load 0.0300 [get_ports {p[38]}]
set_load -pin_load 0.0300 [get_ports {p[37]}]
set_load -pin_load 0.0300 [get_ports {p[36]}]
set_load -pin_load 0.0300 [get_ports {p[35]}]
set_load -pin_load 0.0300 [get_ports {p[34]}]
set_load -pin_load 0.0300 [get_ports {p[33]}]
set_load -pin_load 0.0300 [get_ports {p[32]}]
set_load -pin_load 0.0300 [get_ports {p[31]}]
set_load -pin_load 0.0300 [get_ports {p[30]}]
set_load -pin_load 0.0300 [get_ports {p[29]}]
set_load -pin_load 0.0300 [get_ports {p[28]}]
set_load -pin_load 0.0300 [get_ports {p[27]}]
set_load -pin_load 0.0300 [get_ports {p[26]}]
set_load -pin_load 0.0300 [get_ports {p[25]}]
set_load -pin_load 0.0300 [get_ports {p[24]}]
set_load -pin_load 0.0300 [get_ports {p[23]}]
set_load -pin_load 0.0300 [get_ports {p[22]}]
set_load -pin_load 0.0300 [get_ports {p[21]}]
set_load -pin_load 0.0300 [get_ports {p[20]}]
set_load -pin_load 0.0300 [get_ports {p[19]}]
set_load -pin_load 0.0300 [get_ports {p[18]}]
set_load -pin_load 0.0300 [get_ports {p[17]}]
set_load -pin_load 0.0300 [get_ports {p[16]}]
set_load -pin_load 0.0300 [get_ports {p[15]}]
set_load -pin_load 0.0300 [get_ports {p[14]}]
set_load -pin_load 0.0300 [get_ports {p[13]}]
set_load -pin_load 0.0300 [get_ports {p[12]}]
set_load -pin_load 0.0300 [get_ports {p[11]}]
set_load -pin_load 0.0300 [get_ports {p[10]}]
set_load -pin_load 0.0300 [get_ports {p[9]}]
set_load -pin_load 0.0300 [get_ports {p[8]}]
set_load -pin_load 0.0300 [get_ports {p[7]}]
set_load -pin_load 0.0300 [get_ports {p[6]}]
set_load -pin_load 0.0300 [get_ports {p[5]}]
set_load -pin_load 0.0300 [get_ports {p[4]}]
set_load -pin_load 0.0300 [get_ports {p[3]}]
set_load -pin_load 0.0300 [get_ports {p[2]}]
set_load -pin_load 0.0300 [get_ports {p[1]}]
set_load -pin_load 0.0300 [get_ports {p[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.5000 [current_design]
